Tekla Open API Reference for Tekla Structures 2025
Polycurve Constructor
Overload List
Name | Description
Polycurve()
 Initializes a new instance of the Polycurve class.
Polycurve(ICurve)
 Initializes a new instance of the Polycurve class from a curve geometry.
Polycurve(PolyLine)
 Initializes a new instance of the Polycurve class from a PolyLine. The lines are converted to line segments.
Top
See Also
Reference
Polycurve Class
Tekla.Structures.Geometry3d Namespace